<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>A Royal Affair (2012)</h1>
    <!-- print original title -->
    <h3>En kongelig aff&aelig;re</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/AafVGIirBlCw8Whb4DSPSLX9nGW.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/A%20Royal%20Affair%20%282012%29%20%5B720p%20h264%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">A young queen falls in love with her physician, and they start a revolution that changes their nation forever.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, History, Romance</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Nikolaj Arcel</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Nikolaj Arcel<br /> Rasmus Heisterberg<br /> Bodil Steensen-Leth</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Johann Friedrich Struensee - Mads Mikkelsen<br /> Caroline Mathilde - Alicia Vikander<br /> Christian VII - Mikkel Boe F&oslash;lsgaard<br /> Ove H&oslash;egh-Guldberg - David Dencik<br /> Enevold Brandt - Cyron Melville<br /> Juliane Marie - Trine Dyrholm<br /> Schack Carl Rantzau - Thomas W. Gabrielsson<br /> Frederik VI - William J&oslash;hnk Nielsen<br /> Louise von Plessen - Laura Bro<br /> J. H. E. Bernstoff - Bent Mejding<br /> Reventlow - John Martinus<br /> Marie - Rosalinde Mynster<br /> Augusta - Princess of Wales - Harriet Walter<br /> Hartmann - S&oslash;ren Malling<br /> Arveprinsen - Frederik Christian Johansen<br /> Munter - S&oslash;ren Spanning<br />  - Julia Wentzel Olsen<br />  - Nikol Kouklov&aacute;<br />  - Eyob Nielsen<br /> Juliane's Officer - Jacob Ulrik Lohmann<br />  - Michaela Hork&aacute;<br />  - Alžběta Jenick&aacute;<br />  - Anna Stiborov&aacute;<br />  - Frank Rub&aelig;k<br />  - Klaus Tange<br />  - Petr Jani&scaron;<br />  - Karin R&oslash;rbech<br />  - Josefine H&oslash;jbjerg Bitsch<br />  - Zinnini Elkington<br />  - Morten Holst<br />  - Karel Poli&scaron;ensk&yacute;<br />  - Eva Sitta<br />  - Ivan G'Vera<br />  - Kristian Fjord<br />  - Daniel Bambas<br />  - Tereza Terberov&aacute;<br />  - Jan Krafka<br />  - Peter Varga<br />  - Ivan Vodochodsk&yacute;<br />  - Nora Rajnochov&aacute;<br />  - Jakub Albrecht<br /> Officer - Ludv&iacute;k Kr&aacute;l</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
