<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>All About My Mother (1999)</h1>
    <!-- print original title -->
    <h3>Todo sobre mi madre</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/hjQhzhkGYXPNM96k0mOgob6HMmn.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/All%20About%20My%20Mother%20%281999%29%20%5B576p%20XVID%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Following the tragic death of her teenage son, Manuela travels from Madrid to Barcelona in an attempt to contact the long-estranged father the boy never knew. She reunites with an old friend, an outspoken transgender sex worker, and befriends a troubled actress and a pregnant, HIV-positive nun.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Comedy, Drama</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Manuela - Cecilia Roth<br /> Huma - Marisa Paredes<br /> Nina - Candela Pe&ntilde;a<br /> Agrado - Antonia San Juan<br /> Rosa - Pen&eacute;lope Cruz<br /> Rosa's Mother - Rosa Mar&iacute;a Sard&agrave;<br /> Rosa's Father - Fernando Fern&aacute;n G&oacute;mez<br /> Actor &quot;Doctor&quot; - Fernando Guill&eacute;n<br /> Lola - Toni Cant&oacute;<br /> Esteban - Eloy Azor&iacute;n<br /> Mario - Carlos Lozano<br /> Doctor 1 - Manuel Mor&oacute;n<br /> Doctor 2 - Jos&eacute; Luis Torrijo<br /> Gynecologist - Juan Jos&eacute; Otegui<br />  - Carmen Balagu&eacute;<br /> Malena - Malena Guti&eacute;rrez<br /> Yael - Yael Barnat&aacute;n<br /> Carmen - Carme Fortuny<br /> Pharmacist - Patxi Freytez<br />  - Juan Marquez<br /> Alex - Michel Ruben<br />  - Daniel Lanchas<br />  - Rosa Manaut<br /> Heart Recipient - Carlos Garc&iacute;a Cambero<br /> Taxi Driver - Agust&iacute;n Almod&oacute;var<br /> Heart Recipient's Wife - Paz Sufrategui<br />  - Lola Garc&iacute;a<br />  - Esther Garc&iacute;a<br />  - Inma Subir&agrave;<br /> Mamen (uncredited) - Cayetana Guill&eacute;n Cuervo<br /> Agrado's Friend (uncredited) - Alexia Pardo<br /> (uncredited) - Llu&iacute;s Pasqual<br /> Spectator (uncredited) - Fito P&aacute;ez</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
