<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Bad Education (2004)</h1>
    <!-- print original title -->
    <h3>La mala educaci&oacute;n</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/iJ3iuV9H5Ls5umC0Dxc5sAllvmU.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Bad%20Education%20%282004%29%20%5B1080p%20h265%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Two children, Ignacio and Enrique, know love, the movies and fear in a religious school at the beginning of the 1960s. Father Manolo, director of the school and its professor of literature, is witness to and part of these discoveries. The three are followed through the next few decades, their reunion marking life and death.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>&Aacute;ngel/Juan/Zahara - Gael Garc&iacute;a Bernal<br /> Enrique Goded - Fele Mart&iacute;nez<br /> Padre Manolo - Daniel Gim&eacute;nez Cacho<br /> Sr. Berenguer - Llu&iacute;s Homar<br /> Padre Jos&eacute; - Francisco Maestre<br /> Ignacio - Francisco Boira<br /> Mart&iacute;n - Juan Fern&aacute;ndez<br /> Young Ignacio - Nacho P&eacute;rez<br /> Young Enrique - Ra&uacute;l Garc&iacute;a Forneiro<br /> Paca/Paquito - Javier C&aacute;mara<br /> Enrique Serrano - Alberto Ferreiro<br /> Madre - Petra Mart&iacute;nez<br /> Transformista - Sandra<br /> Camarero - Roberto Hoyas<br /> Limpiador Piscina (uncredited) - Agust&iacute;n Almod&oacute;var<br /> Man in Public (uncredited) - Robert Forcadell<br /> Motero Ochentero (uncredited) - Luis Lobos Negros<br /> Ni&ntilde;o (uncredited) - Pol Monen<br /> Soledad (archive footage) (uncredited) - Sara Montiel<br /> Ni&ntilde;o (uncredited) - Pau Poch<br /> M&oacute;nica (uncredited) - Leonor Watling<br /> Extra (uncredited) - Jos&eacute; Mar&iacute;a Y&aacute;zpik</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
