<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Biutiful (2010)</h1>
    <!-- print original title -->
    <h3>Biutiful</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/8cj0Q2uFfpTkCw4gMqqcTBpdoqF.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Biutiful%20%282010%29%20%5B1080p%20h265%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">This is a story of a man in free fall. On the road to redemption, darkness lights his way. Connected with the afterlife, Uxbal is a tragic hero and father of two who's sensing the danger of death. He struggles with a tainted reality and a fate that works against him in order to forgive, for love, and forever.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Alejandro Gonz&aacute;lez I&ntilde;&aacute;rritu</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Alejandro Gonz&aacute;lez I&ntilde;&aacute;rritu<br /> Armando Bo<br /> Nicol&aacute;s Giacobone</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Uxbal - Javier Bardem<br /> Marambra - Maricel &Aacute;lvarez<br /> Ana - Hanaa Bouchaib<br /> Mateo - Guillermo Estrella<br /> Tito - Eduard Fern&aacute;ndez<br /> Ekweme - Cheikh Ndiaye<br /> Ige - Diaryatou Daff<br /> Hai - Cheng Taishen<br /> Liwei - Luo Jin<br /> Samuel - George Chibuikwem Chukwuma<br /> Li - Lang Sofia Lin<br /> Chino Obeso - Yodian Yang<br /> Barman Bar Hai - Tuo Lin<br /> Chino Bodega - Xueheng Chen<br /> Jung - Xiaoyan Zhang<br /> Padre Hai - Ailie Ye<br /> Madre Hai - Xianlin Bao<br /> Bea - Ana Wagener<br /> Zanc - Rub&eacute;n Ochandiano<br /> Mendoza - Karra Elejalde<br /> Muchacho - Nasser Saleh<br /> Hombre de Luto - Tom&aacute;s del Estal<br /> Ni&ntilde;o Muerto - &Aacute;ngel Luis Arjona<br /> Se&ntilde;ora Funeral - Dolores Echepares<br /> Mujer Grande - Adelfa Calvo<br /> M&eacute;dico - Manolo Solo<br /> Enfermera - Violeta P&eacute;rez<br /> Cirujano 1 - Germ&aacute;n Almendros<br /> Cirujano 2 - Isaac Alcayde<br /> Cirujano 3 - Nacho Molin&eacute;<br /> Vieja - Carmen La Lata<br /> Secretaria Fincas - Annabel Totusaus<br /> Hombre Semidesnudo - Eduardo G&oacute;mez<br /> Empleado Cementerio 1 - Ram&oacute;n Elies<br /> Empleado Cementerio 2 - Juan Vicente S&aacute;nchez<br /> Bur&oacute;crata - F&eacute;lix Cubero<br /> Mesera - Carmen Peleteiro<br /> Alcalde - Federico Mu&ntilde;oz<br /> Chica Joven 2 - Leticia Albizuri<br /> Presentadora Informativos - Maria Casado<br /> Reportera Informativos - Judith Huertas<br /> Bailarinas Stripper Bar - Aroa Ortiz<br /> Bailarinas Stripper Bar - Victoria M. D&iacute;az<br /> Bailarinas Stripper Bar - Sonia Cruz<br /> Bailarinas Stripper Bar - Luna Jim&eacute;mez Colindres<br /> Bailarinas Stripper Bar - Dunia Montenegro<br /> Bailarinas Stripper Bar - Rodica Ioana Ungureanu<br /> Mosso d'Esquadra Antidisturbio (uncredited) - Albert Grabuleda Capdevila<br /> (uncredited) - Alain Hern&aacute;ndez<br /> Pla&ntilde;idera (uncredited) - Pitu Princess<br /> Mosso d'Esquadra (uncredited) - Jesus Puchol<br /> Bailarinas Stripper Bar - Sophie Evans</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
