<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Broken Embraces (2009)</h1>
    <!-- print original title -->
    <h3>Los abrazos rotos</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/uPTOKnc9bzPp1emH3TyuKOGIylQ.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Broken%20Embraces%20%282009%29%20%5B360p%20h264%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Harry Caine, a blind writer, reaches this moment in time when he has to heal his wounds from 14 years back. He was then still known by his real name, Mateo Blanco, and directing his last movie.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, Romance, Thriller</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Lena - Pen&eacute;lope Cruz<br /> Mateo Blanco / Harry Caine - Llu&iacute;s Homar<br /> Judit Garc&iacute;a - Blanca Portillo<br /> Ernesto Martel - Jos&eacute; Luis G&oacute;mez<br /> Ray X - Rub&eacute;n Ochandiano<br /> Diego - Tamar Novas<br /> Lena's Mother - &Aacute;ngela Molina<br /> Concierge - Chus Lampreave<br /> Madame Mylene - Kiti M&aacute;nver<br /> Lip Reader - Lola Due&ntilde;as<br /> Edurne - Mariola Fuentes<br /> Chon - Carmen Machi<br /> Model - Kira Mir&oacute;<br /> Julieta - Rossy de Palma<br /> &Aacute;lex - Alejo Sauras<br />  - Carlos Sampedro<br /> Lena's Father - Ram&oacute;n Pons<br />  - Cot&eacute; Soler<br /> Maribel - Marta Aledo<br />  - Carlos Leal<br /> Dr. Blasco - Chema Ruiz<br /> Ray X's Boyfriend - Dani Mart&iacute;n<br />  - J&ouml;ns Pappila<br /> Luis - Javi Coll<br />  - Juan Bautista Cucarella<br />  - Lyng Dyrup<br />  - Enrique Aparicio<br />  - Enrique Vargas<br />  - Viviana Espinoza<br /> Montador de Avid - Fernando Lueches<br />  - Fernando Iglesias<br /> Camello - Javier Giner<br />  - Carlos Garc&iacute;a Cambero<br />  - Bina Daigeler<br /> Gardener - Agust&iacute;n Almod&oacute;var<br />  - Esther Garc&iacute;a<br /> Production Assistant - Karola S&aacute;nchez<br /> Cinearte Receptionist (uncredited) - Yuyi Beringola<br /> Man Walking the Dog and Greeting Lena's Mother (uncredited) - Jos&eacute; Coromina<br /> Assistant Director (uncredited) - Sergio D&iacute;az<br /> Vecino Enrollado Bar (uncredited) - Jaime Fern&aacute;ndez-Cid Buscat&oacute;</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
