<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Che: Part One (2008)</h1>
    <!-- print original title -->
    <h3>Che: Part One</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/jWgPiVTmJsHWKVjAy2gvSFUH9yA.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Che%20-%20Part%20One%20%282008%29%20%5B720p%20h264%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">The Argentine, begins as Che and a band of Cuban exiles (led by Fidel Castro) reach the Cuban shore from Mexico in 1956. Within two years, they mobilized popular support and an army and toppled the U.S.-friendly regime of dictator Fulgencio Batista.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, History, War</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Steven Soderbergh</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Peter Buchman</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Ernesto Che Guevara - Benicio del Toro<br /> Fidel Castro - Demi&aacute;n Bichir<br /> Camilo Cienfuegos - Santiago Cabrera<br /> Ramiro Vald&eacute;s Men&eacute;ndez - Vladimir Cruz<br /> Israel Pardo - Alfredo de Quesada<br /> Jorge Sotus - Jsu Garcia<br /> Leonardo Tamayo N&uacute;&ntilde;ez - Kahlil M&eacute;ndez<br /> Celia S&aacute;nchez - Elvira M&iacute;nguez<br /> Joel Iglesias Leyva - Andres Munar<br /> Lisa Howard - Julia Ormond<br /> Vilo (Juan Vitalo Acu&ntilde;a) - Jorge Perugorr&iacute;a<br /> Ciro Redondo Garc&iacute;a - Edgar Ram&iacute;rez<br /> Rogelio Acevedo - Victor Rasuk<br /> Pombo (Harry Villegas) - Othello Rensoli<br /> Benigno (Dariel Alarc&oacute;n Ram&iacute;rez) - Armando Riesco<br /> Aleida March - Catalina Sandino Moreno<br /> Juan Almeida - Roberto Santana<br /> Tuma (Carlos Coello) - Norman Santiago<br /> Ra&uacute;l Castro - Rodrigo Santoro<br /> Vaquerito - Unax Ugalde<br /> Hector - Ramon Fernandez<br /> Guile Pardo - Roberto Urbina<br /> Alejandro Ramirez - Yul Vazquez<br /> U.N. Interpreter - Oscar Isaac<br /> Dinner Guest #1 - Pablo Guevara<br /> Dinner Guest #2 - Franklin D&iacute;az<br /> Dinner Guest #3 - Armando Su&aacute;rez Cobi&aacute;n<br /> Mar&iacute;a Antonia - Mar&iacute;a Isabel D&iacute;az Lago<br /> Cuban Diplomat #1 - Mateo G&oacute;mez<br /> Esteban - Jose Caro<br /> Epifan&iacute;o D&iacute;az - Pedro Adorno<br /> Rebel Messenger #1 - Luis Alfredo Rodr&iacute;guez S&aacute;nchez<br /> Vilma Esp&iacute;n - Maris&eacute; &Aacute;lvarez<br /> O&ntilde;ate Cantinfl&aacute;s - Christian Nieves<br /> Quike Escalona - Liddy Paoli Lopez<br /> Rebel Guide - Francisco Cabrera<br /> Eligio Mendoza - Pedro Tel&eacute;maco<br /> Army Doctor - Miguel &Aacute;ngel Su&aacute;rez<br /> Pedro Chape - Juan Pedro Torriente<br /> Make-Up Artist - Io Bottoms<br /> Cuban Man at Bar #1 - Manuel Cabral<br /> Cuban Man at Bar #2 - Oscar A. Colon<br /> Tad Szulc - Sam Robards<br /> Richard Hottelet - Jay Potter<br /> Paul Niven - Stephen Mailer<br /> Cuban Diplomat #2 - Ren&eacute; Lavan<br /> Otto - Octavio G&oacute;mez Berr&iacute;os<br /> Mar&iacute;a - Blanca Lissette Cruz<br /> Laura - Laura And&uacute;jar<br /> Old Woman #1 - Georgina Borri<br /> Umberto - Alejandro Renteria<br /> Omar - Israel Lugo<br /> Cuervo - Bryant Huffman<br /> Esteban's Accomplice - Xavier Morales<br /> Polo - Jos&eacute; Luis Guti&eacute;rrez<br /> Sen. Eugene McCarthy - Jon DeVries<br /> Partygoer #1 - Leslie Lyles<br /> Partygoer #2 - Meg Gibson<br /> Partygoer #3 - Alex Manette<br /> Partygoer #4 - Elvis Nolasco<br /> Partygoer #5 - Sheridan Lowell<br /> Emilio Cabrera - Eugenio Monclova<br /> Dr. Julio Mart&iacute;nez P&aacute;ez - Jose A. Nieves<br /> Lalo Sardi&ntilde;as - Luis Gonzaga Hernandez<br /> Ra&uacute;l Chib&aacute;s - Joksan Ramos<br /> Felipe Pazos - Javier Ortiz<br /> Rebel Luis - Luis Rosario<br /> Gustavo - Osmin Hernandez<br /> Jes&uacute;s - Julio Cesar Morales<br /> Army Medic - Leonardo Castro Sitiriche<br /> Bazooka Guy #1 - Oscar De La Fe Colon<br /> Bazooka Guy #2 - Luis Arriaga<br /> Secretary - Monique Gabriela Curnen<br /> Captain Stanton - P.J. Benjamin<br /> Angry Demonstrator #1 - Al Espinosa<br /> Angry Demonstrator #2 - Ana Maria Andricain<br /> U.S. Ambassador Stevenson - Michael Countryman<br /> Enrique Acevedo - Jorge Armando<br /> Carmen - Aris Mejias<br /> Ventriloquist (Albertico) - Carlitos Ruiz Ruiz<br /> Old Woman #2 - Victoria Espinosa<br /> Nicaragua Ambassador - Joe Urla<br /> Venezuela Ambassador - Diego Arria<br /> Panama Ambassador - Omar Rodr&iacute;guez<br /> S&aacute;nchez Mosquera - Eduardo Cort&eacute;s<br /> Faustino P&eacute;rez - Joaqu&iacute;n M&eacute;ndez<br /> Ren&eacute; Ramos Latour - Pablo Venegas Col&oacute;n<br /> Nico Torres - Jerry Nelson Soto<br /> Ovidio D&iacute;az Rodr&iacute;guez - Jos&eacute; Brocco<br /> Rolando Cubela - Juan Carlos Arvelo<br /> Enrique Oltuski - Yamil Collazo<br /> Faure Chom&oacute;n - Roy S&aacute;nchez-Vahamondes<br /> Eloy Guti&eacute;rrez Menoyo - Alejandro Carpio<br /> Hermes Pe&ntilde;a Torres - Andres Santiago Bravo<br /> Victor Bord&oacute;n Machado - Aurelio Lima<br /> Aleida's Friend - Alba Caraballo<br /> Oltuski's Messenger - Doel Alicea<br /> Lieutenant P&eacute;rez Valencia - Rafa Alvarez<br /> Dr. Fern&aacute;ndez Mell - Jos&eacute; Cott&eacute;<br /> Woman in Crowd - Naya Tanya Rivera<br /> Miguel (Manuel Hern&aacute;ndez Osorio) - N&eacute;stor Rodulfo<br /> Colonel Joaqu&iacute;n Casillas Lumpuy - Luis Alberto Garc&iacute;a<br /> Colonel Hern&aacute;ndez - Te&oacute;filo Torres<br /> Fern&aacute;ndez Suero - Ernesto Ruiz Faxas<br /> Antonio Jim&eacute;nez - Ricardo &Aacute;lvarez<br /> Man with Sledgehammer - Miguel Rodarte<br /> Rebel Messenger #2 - Rafael Sim&oacute;n<br /> Colonel Rojas - Bruno Bichir<br /> Police Officer - Gerardo Albarr&aacute;n<br /> Comandante G&oacute;mez Calder&oacute;n - Guillermo R&iacute;os<br /> Red Cross Worker - Victor Angulo Villacis<br /> Aide to Hern&aacute;ndez - Fernando Guti&eacute;rrez Vargas<br /> Man Greeting Che - Ramiro Garza Balboa<br /> Cook at Cuban Embassy - Carmen Mahiques<br /> Carlos - Euriamis Losada<br /> Soldier Hector (uncredited) - Jorge Alberti<br /> Soldier (uncredited) - Fernando Arroyo<br /> Soldier Jose (uncredited) - Javier Bellido Cintr&oacute;n<br /> U.N. Delegate (uncredited) - Lou D'Amato<br /> Wounded Rebel (uncredited) - Ramiro 'Ramir' Delgado Ruiz<br /> Press Photogropher (uncredited) - Dave Dyshuk<br /> Aleida's Companion (uncredited) - Jonathan Fret<br /> U.N. Delegate (uncredited) - Brian Hopson<br /> Protestor at United Nations (uncredited) - Rebecca Merle<br /> Soldier (uncredited) - Jean Pierre Prats<br /> U.N. Protester (uncredited) - Alexandra Tejeda Rieloff<br /> Batista Soldier (uncredited) - Ektor Rivera<br /> Romanian Diplomat at U.N. (uncredited) - Kent Sladyk<br /> Protester (uncredited) - Susie Stewart Rubio<br /> David Salvador (uncredited) - Guillermo Valed&oacute;n<br /> Cuban Rebel (uncredited) - Gerardo Jos&eacute; Vega<br /> Juan Carlos Esteves's Daughter (uncredited) - Tania Vega</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
