<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Che: Part Two (2008)</h1>
    <!-- print original title -->
    <h3>Che: Part Two</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/pB4vtOhKRLid2lF0bBtoAkstGPe.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Che%20-%20Part%20Two%20-%20Criterion%20Collection%20%282008%29%20%5B1080p%20h265%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">After the Cuban Revolution, Che is at the height of his fame and power. Then he disappears, re-emerging incognito in Bolivia, where he organizes a small group of Cuban comrades and Bolivian recruits to start the great Latin American Revolution. Through this story, we come to understand how Che remains a symbol of idealism and heroism that lives in the hearts of people around the world.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, History, War</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Steven Soderbergh</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Peter Buchman<br /> Benjamin A. Van Der Veen<br /> Che Guevara</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Ernesto Che Guevara - Benicio del Toro<br /> Mois&eacute;s Guevara - Carlos Bardem<br /> Fidel Castro - Demi&aacute;n Bichir<br /> President Ren&eacute; Barrientos - Joaquim de Almeida<br /> Pacho (Alberto Fern&aacute;ndez Montes de Oca) - Pablo Dur&aacute;n<br /> Ciro Algara&ntilde;az - Eduard Fern&aacute;ndez<br /> R&eacute;gis Debray - Marc-Andr&eacute; Grondin<br /> Dar&iacute;o (David Ardiazola) - &Oacute;scar Jaenada<br /> Urbano (Leonardo Tamayo N&uacute;&ntilde;ez) - Kahlil M&eacute;ndez<br /> Inti (Guido Peredo Liegue) - Cristian Mercado<br /> Captain Mario Vargas - Jordi Moll&agrave;<br /> Ciro Bustos - Gast&oacute;n Pauls<br /> Coco (Roberto Peredo Liegue) - Antonio Peredo<br /> Joaquin (Juan Vitalo 'Vilo' Acu&ntilde;a) - Jorge Perugorr&iacute;a<br /> Mario Monje - Lou Diamond Phillips<br /> Tania (Haydee Tamara Bunke Bider) - Franka Potente<br /> Pombo (Harry Villegas Tamayo) - Othello Rensoli<br /> Benigno (Dariel Alarc&oacute;n Ramirez) - Armando Riesco<br /> Miguel (Manuel Hern&aacute;ndez Osorio) - N&eacute;stor Rodulfo<br /> Aleida March - Catalina Sandino Moreno<br /> Tuma (Carlos Coello) - Norman Santiago<br /> Ra&uacute;l Castro - Rodrigo Santoro<br /> George Roth - Mark Umbers<br /> Alejandro Ram&iacute;rez - Yul Vazquez<br /> Aleidita - Mar&iacute;a D. Sosa<br /> Bolivian Customs Agent #1 - Ra&uacute;l Beltr&aacute;n<br /> Bolivian Customs Agent #2 - Ra&uacute;l 'Pit&iacute;n' G&oacute;mez<br /> Woman at Airport - Paty M. Bellott<br /> Loro (Jorge V&aacute;zquez Via&ntilde;a) - Ezequiel D&iacute;az<br /> Polo (Apolinar Aquino Quispe) - Juan Salinas<br /> Serapio Aquino Tudela - Luis Mu&ntilde;oz<br /> Camba (Orlando Jim&eacute;nez Bazn&aacute;n) - Lorenzo Ariel Mu&ntilde;oz<br /> Ricardo (Jos&eacute; Mar&iacute;a Mart&iacute;nez Tamayo) - Aar&oacute;n Vega<br /> Braulio (Israel Reyes Zayas) - Giraldo Mois&eacute;s<br /> Rolando (Eliseo Reyes Rodriguez) - Rub&eacute;n Ochandiano<br /> Ernesto (Freddie Maymura Hurtado) - Roberto Guilhon<br /> Antonio Dom&iacute;nguez Flores - Carlos Acosta-Milian<br /> Arturo (Ren&eacute; Mart&iacute;nez Tamayo) - Edgardo Rodr&iacute;guez<br /> Moro (Octavio de la Concepci&oacute;n y de la Pedraja) - Jos&eacute; Juan Rodr&iacute;guez<br /> &Ntilde;ato (Julio Luis M&eacute;ndez Korne) - Daniel Larraz&aacute;bal<br /> Julio - Wilder Salinas<br /> Eustaquio (Lucio Edilberto Galv&aacute;n Hidalgo) - Jimmy A. C&eacute;spedes<br /> Salustio Choque Choque - Eit&aacute;n V&aacute;zquez<br /> Pedro (Antonio Jim&eacute;nez Tardio) - Oscar Aviles<br /> Paco (Jos&eacute; Castillo Ch&aacute;vez) - Ruben Salinas<br /> Aniceto Reinaga - Daniel Aguirre<br /> Carlos - Miguel Villarroel<br /> Willy (Sim&oacute;n Cuba Saravia) - Diego Ortiz<br /> Chapaco (Jaime Arana Campero) - Jorge Arturo Lora<br /> Vilma Esp&iacute;n - Maris&eacute; &Aacute;lvarez<br /> El Vallegrandino - Eduardo Espinosa<br /> Lieutenant Carlos Fern&aacute;ndez - Antonio de la Torre<br /> Plainclothes Policeman - Marco Antonio<br /> Honorato Rojas - Luis Bredow<br /> Honorato's Wife - Mar&iacute;a Cristina Cal&aacute;<br /> Pablito (Francisco Huanca) - Edison Narv&aacute;ez<br /> Daniel (Pastor Barrera Quintana) - Bart Santana<br /> Eusebio Tapia Arune - Ra&uacute;l N&uacute;&ntilde;ez<br /> Vicente Roeabado Terrazas - Jes&uacute;s Carrillo<br /> Chino (Juan Pablo Chang) - Jos&eacute; Julio Park<br /> Major Hern&aacute;n Plata - Juan Carlos Vellido<br /> Captured Soldier #1 - Ra&uacute;l Ar&eacute;valo<br /> Captured Soldier #2 - Daniel Holgu&iacute;n<br /> Captured Soldier #3 - Sergio Deustua<br /> American #1 - Tom Minder<br /> American #2 - Andrew Petrotta<br /> American #3 - Frederic W. Brost<br /> Padilla - Geischglin Rojas<br /> Captain Mitchell - Stephen Casmier<br /> Major Ralph 'Pappy' Shelton - James D. Dever<br /> Captain Gary Prado - Roberto San Mart&iacute;n<br /> Bolivian Interrogator - Luis Callejo<br /> Fr. Schwartz - Matt Damon<br /> Reporter #1 - Eduard Sanjines<br /> Reporter #2 - Diego Salazar<br /> Reporter #3 - Ren&eacute; Arag&oacute;n<br /> Colonel Joaqu&iacute;n Zenteno - Pedro Casablanc<br /> General Alfredo Ovando Cand&iacute;a - Tom&aacute;s del Estal<br /> Chingolo - David Zambrana<br /> Soldier Playing Possum - Flavio Morales<br /> Hiding Soldier - Jos&eacute; Mar&iacute;a Pi&ntilde;eda<br /> Store Owner - M&oacute;nica Montoya<br /> Coca Vendor - Sa&uacute;l Avila<br /> Prado's Radio Operator - Miguel Antelo<br /> Lieutenant Colonel Andr&eacute;s Selich - David Selvas<br /> Eduardo - Jes&uacute;s Carroza<br /> Guard at Door - C&eacute;sar Salgado<br /> Bolivian Soldier - Mart&iacute;n Bello<br /> Lieutenant Eduardo Huerta - Vismark Tito Rojas<br /> Lieutenant Carlos P&eacute;rez - Enrique Arce<br /> Sergeant Mario Ter&aacute;n - Cristhian Esquivel<br /> Rudolfo (uncredited) - Benjam&iacute;n Ben&iacute;tez<br /> Embassy Girl (uncredited) - Mariu B&aacute;rcena<br /> Ernesta Loud Demonstrator (uncredited) - Mizan Kirby<br /> Ranger Boliviano (uncredited) - Antonio Pardo<br /> Un delegate (uncredited) - Jason Rivera<br /> Indian Diplomat (uncredited) - Uzimann<br /> News Cameraman (uncredited) - Steven Weisz</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
