<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Law of Desire (1987)</h1>
    <!-- print original title -->
    <h3>La ley del deseo</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/tAKaUaYGPCUStvlOaLwsJldrOJQ.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Law%20of%20Desire%20%281987%29%20%5B480p%20h264%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Pablo, a successful film director, disappointed in his relationship with his young lover, Juan, concentrates in a new project, a monologue starring his transgender sister, Tina. Antonio, an uptight young man, falls possessively in love with the director and in his passion would stop at nothing to obtain the object of his desire.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, Romance, Thriller, Comedy</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Pedro Almod&oacute;var</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Pablo Quintero - Eusebio Poncela<br /> Tina Quintero - Carmen Maura<br /> Antonio Ben&iacute;tez - Antonio Banderas<br /> Juan Berm&uacute;dez - Miguel Molina<br /> Detective - Fernando Guill&eacute;n<br /> Ada - Manuela Velasco<br /> Doctor Mart&iacute;n - Nacho Mart&iacute;nez<br /> Ada&rsquo;s Mother - Bibiana Fern&aacute;ndez<br /> Antonio&rsquo;s Mother - Helga Lin&eacute;<br /> El Cura - Germ&aacute;n Cobos<br /> Polic&iacute;a hijo - Fernando Guill&eacute;n Cuervo<br /> Groupi. - Marta Fern&aacute;ndez Muro<br /> Enfermera - Lupe Barrado<br /> Sargento - Alfonso Vallejo<br /> Hermana de Juan - Maruchi Le&oacute;n<br /> Guardia joven - Jos&eacute; Manuel Bello<br /> Abogado - Agust&iacute;n Almod&oacute;var<br /> Locutora tele - Rossy de Palma<br /> Polic&iacute;a (as Jos&eacute; R. Pardo) - Jos&eacute; Ram&oacute;n Pardo<br /> Modelo Impo. - Juan A. Granja<br /> Chica - Angie Gray<br /> Periodista - Hector Saurint<br /> Chico 1 - Jos&eacute; Ram&oacute;n Fern&aacute;ndez<br /> Dependiente - Pepe Patat&iacute;n<br /> Girl with Juan (uncredited) - Victoria Abril<br /> Dependiente ferreter&iacute;a (uncredited) - Pedro Almod&oacute;var<br /> Actor de doblaje 1 (uncredited) - Manuel Cano<br /> Chico que intenta ligar con Juan en el bar (uncredited) - Fabio McNamara<br /> Actor de doblaje 2 (uncredited) - Jos&eacute; Moratalla</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
