<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Lunacy (2005)</h1>
    <!-- print original title -->
    <h3>&Scaron;&iacute;len&iacute;</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/n03zXfOnaMvv3m9F2Y2Hp9jRZCE.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Lunacy%20%282005%29%20%5B480p%20XVID%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">A man takes up residence with a mysterious marquis and is soon persuaded to enter into an asylum for preventative therapy. Things are not what they seem, and the marquis may be even more sinister than what the young man may've predicted.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Comedy, Horror</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Jan &Scaron;vankmajer</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Jan &Scaron;vankmajer</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Jean Berlot - Pavel Li&scaron;ka<br /> Marquis - Jan Tř&iacute;ska<br /> Charlota - Anna Geislerov&aacute;<br /> Dr. Murlloppe - Jaroslav Du&scaron;ek<br /> Dr. Coulmiere - Martin Huba<br /> Feeble-minded Warden - Karel Heřman<br /> Servant Dominik - Pavel Nov&yacute;<br /> Innkeeper - Stano Dančiak<br /> Reciting Madman - Jiř&iacute; Krytin&aacute;ř<br /> Asylum Inmate - Kateřina Růžičkov&aacute;<br /> Asylum Inmate - Iva Littmanov&aacute;<br /> Asylum Inmate - Katerina Valachov&aacute;<br /> Insane Erotomaniac - Josef Kaspar<br /> Dream Warden - Miroslav Navr&aacute;til<br /> Dream Warden - Jiř&iacute; Maria Sieber<br /> Ostler - Ctirad G&ouml;tz<br /> Naked Madman / Homeless - Milan David<br /> Naked Madman - Michael Hoffbauer<br /> Woman in Art Therapy - Renata S&aacute;tkov&aacute;<br /> Warden - Vladim&iacute;r M&iacute;ka<br /> Warden - Milan Borovicka<br /> Warden - Lubos Doksansk&yacute;<br /> Warden - Vladim&iacute;r Hodr<br /> Madman in Wheelchair - Josef Pol&aacute;&scaron;ek<br /> Miss Rossetov&aacute; - Hana Dvor&aacute;kov&aacute;<br /> Homeless - Vaclav Jezek<br /> Man with Overturned Car - Frantisek Polata<br /> Old Woman on Bike with Goat - Jirina Kutilov&aacute;</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
