<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Paris, 13th District (2021)</h1>
    <!-- print original title -->
    <h3>Les Olympiades</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/kSXPsrausCYVsDnQaJfhzqR9fV7.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Paris%2C%2013th%20District%20%282021%29%20%5B1080p%20h265%205.1%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">&Eacute;milie meets Camille who is attracted to Nora, who crosses paths with Amber. Three girls and a boy &ndash; They're friends, sometimes lovers and often both.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, Romance</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Jacques Audiard</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Jacques Audiard<br /> C&eacute;line Sciamma<br /> L&eacute;a Mysius</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>&Eacute;milie - Lucie Zhang<br /> Camille - Makita Samba<br /> Nora - No&eacute;mie Merlant<br /> Amber - Jehnny Beth<br /> Eponine - Camille L&eacute;on-Fucien<br /> St&eacute;phanie - Oceane Cairaty<br /> Le&iuml;la - Ana&iuml;de Rozam<br /> Camille's Father - Pol White<br /> Emilie's Mother - Rong-Ying Yang<br /> Karin - Genevi&egrave;ve Doang<br /> Emilie's Grandmother - Xing Xing Cheng<br /> Call Center Director - Fabienne Galula<br /> Head of Tele-consultants - Lilian Nze Nong<br /> Call Center - Ornella Nzingoula<br /> Call Center - Tony Zola<br /> Woman in Wheelchair - Annabelle Milot<br /> Sandra - Lumina Wang<br />  - Stephen Manas<br />  - Raphaelle Doyle<br /> Girl Party Apartment - L&eacute;o Mira<br /> Girl Party Apartment - L&eacute;a Rostain<br /> Girl Party Apartment - Agathe Mougin<br /> Girl Party Apartment - Isadora Guzniczak<br /> Jeff - Rapha&euml;l Quenard<br /> Self - Teki Latex<br /> Gar&ccedil;on Dance-floor Springbreak - Jules Benchetrit<br /> Gar&ccedil;on Dance-floor Springbreak - Hugo Lacroix<br /> Gar&ccedil;on Dance-floor Springbreak - Th&eacute;otim Leclerc<br /> Fill Springbreak - Jeanne Disson<br /> Jonathan - Nicolas Godart<br /> Mr. Lim Tchoq - Yves Yan<br /> Amine - Carl Malapa<br /> Law Professor - Bruno Dondero<br /> Client Visit Apartment - Steve Chaban<br /> Le&iuml;la's Friend - Matt&eacute;o La Capria<br /> Serveuse Eighty - Line Ph&eacute;<br /> Serveuse Eighty - Feichan Zeng<br /> Serveuse Eighty - Weiting Chao<br /> Serveuse Eighty - Feng Lili<br /> J&eacute;r&ocirc;me - Patrick Gu&eacute;rineau<br /> Receptionist EHPAD - Lily Rubens<br /> Anicet - Tony Harrisson<br /> Jeanne Lecoeur - Soumay&eacute; Bocoum<br /> Carrie Lam - Carrie Lam</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
