<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Taxi (1998)</h1>
    <!-- print original title -->
    <h3>Taxi</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/egBxj3ude84theXc3cLbBHrWOkQ.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Taxi%20%281998%29%20%5B480p%20XVID%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">In Marseilles (France), skilled pizza delivery boy Daniel who drives a scooter finally has his dreams come true. He gets a taxi license. Caught by the police for a huge speed infraction, he will help Emilien, a loser inspector who can't drive, on the track of German bank robbers, so he doesn't lose his license and his dream job.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Comedy, Action, Crime, Adventure</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>G&eacute;rard Pir&egrave;s</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Luc Besson</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Daniel Morales - Samy Naceri<br /> &Eacute;milien Coutant-Kerbalec - Fr&eacute;d&eacute;ric Diefenthal<br /> Lilly Bertineau - Marion Cotillard<br /> Camille Coutant-Kerbalec - Manuela Gourary<br /> Petra - Emma Wiklund<br /> Commissaire Gibert - Bernard Farcy<br /> Joe - Georges Neri<br /> Pizza Joe Motorcyclist - Guy Quang<br /> Pensioned Taxi Driver - Maurice Murcia<br /> Femme Pr&eacute;fecture - Sabine Bail<br /> Paulo - Dan Herzberg<br /> Driving Instructor - S&eacute;bastien Thiery<br /> Butcher - Eric B&eacute;renger<br /> Passenger to Airport - Philippe du Janerand<br /> Flic Radar #1 - Christophe Fesquet<br /> Flic Radar #2 - G&eacute;rard Vantaggioli<br /> Alain - &Eacute;douard Montoute<br /> Coll&egrave;gue Emilien - Tara R&ouml;mer<br /> Pilote Ringard #1 - Christian Mazucchini<br /> Pilote Ringard #2 - Guillaume Lanson<br /> Rachid - S&eacute;bastien Pons<br /> Marco - Malek Bechar<br /> Chauffeur Gibert - G&eacute;rard Dubouche<br /> German Gangster #1 - Richard Sammel<br /> German Gangster #2 - Niels Dubost<br /> German Gangster #3 - Franck Libert<br /> Ministre - Dominique No&eacute;<br /> Chauffeur - Pierre Brichese<br /> German Gangster #4 - Stephan Chrisz<br /> Kr&uuml;ger Bar Patron - Paul Fructus<br /> Kr&uuml;ger - Gr&eacute;gory Knop<br /> Chef Pompier - Denis Braccini<br /> Flic Barrage Valises - Bernard Destouches<br /> Homme Nettoyeur Banque - Emilio Martinez<br /> Femme Nettoyeur Banque - Catherine Alias<br /> Jimmy - St&eacute;phane Algoud<br /> Caissier Banque - Thierry Melia<br /> Jean Bat - J&eacute;r&ocirc;me Leleu<br /> Jeune Flic M&eacute;rris - Jean-Fran&ccedil;ois Palaccio<br /> Vieux Flic M&eacute;rris - Henri Masini<br /> Flic Feu Rouge No. 13 - Jean-Baptiste Chaudoul<br /> Pr&eacute;fet - Paul Silve<br /> Cas 1er Carton - Didier Gayral<br /> Flic Radar #3 - St&eacute;phane Eichenholc</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
