<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>The Dance of Reality (2013)</h1>
    <!-- print original title -->
    <h3>La danza de la realidad</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/2qbsG9t943DciYTHITISzXQltqt.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/The%20Dance%20of%20Reality%20%282013%29%20%5B480p%20XVID%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">&ldquo;Having broken away from my illusory self, I was desperately seeking a path and a meaning to life.&rdquo; This phrase perfectly sums up Alejandro Jodorowsky&rsquo;s biographical project: reconstituting the incredible adventure of his life. Alejandro Jodorowsky was born in 1929 in Tocopilla, a coastal town on edge of the Chilean desert, where this film was shot. It was there where he discovered the fundamentals of reality, as he underwent an unhappy and alienated childhood as part of an uprooted family.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Drama, Fantasy</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Alejandro Jodorowsky</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Alejandro Jodorowsky</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Jaime - Brontis Jodorowsky<br /> Sara - Pamela Flores<br /> Child Alejandro - Jeremias Herskovits<br /> Old Alejandro - Alejandro Jodorowsky<br /> Carlos Iba&ntilde;ez - Basti&aacute;n Bodenh&ouml;fer<br /> Don Aquiles - Andr&eacute;s Cox<br /> Anarchist - Adan Jodorowsky<br /> Te&oacute;sofo - Axel Jodorowsky<br /> Hunchback Woman - Alizarine Ducolomb<br /> Carpenter - Sergio Vargas<br /> Propagandist - Patricio Brambilla<br /> Evangelic Pastor - Juan Quezada<br /> Clown Lechuga / Guat&oacute;n Gonz&aacute;lez - Adri&aacute;n Salgado<br /> Clown Piripipi - &Iacute;talo Tai<br /> Clown Zanahoria - Eugenio Morales<br /> Mayor - Carlos Cantero<br /> Reina de Copas - Luz Jim&eacute;nez<br /> El Moscard&oacute;n - Charles Bustos<br /> Ice Cream Seller - Hugo Mar&iacute;n<br /> Dentist - Nelson Gonz&aacute;lez<br /> Lt. Cuevas - Rorigo Orellana<br /> Rosita - Helen Tabilo<br /> Profesor Toro - Demetrio Spataris<br /> La To&ntilde;a - Ver&oacute;nica Power<br /> Flaco Jara - Nicol&aacute;s de Ter&aacute;n<br /> Tuerto Valdivia - Sergio Monge<br /> Compa&ntilde;ero Fierro - Victor Toledo<br /> Conspiradores Transformistas - Brittany Star<br /> Capit&aacute;n Pedraza - Ricardo Zepeda<br /> Carlitos y Luchito - Tom&aacute;s &Aacute;lvarez<br /> Ni&ntilde;o Jefe - Dilan Avenda&ntilde;o<br /> Nazi Officer - Marcelo Alonso<br /> Nazi spokesman - Sebasti&aacute;n Layseca<br /> Priest - Alejandro Sieveking<br /> Liberator 1 - Gast&oacute;n Pauls<br /> Tortured Woman - Sissi Fuentealba<br /> Tortured Man - Gast&oacute;n Salgado<br /> Police Officer - Nicol&aacute;s Saavedra<br /> Bar Musician - Pedro Fontaine<br /> Bar Musician - Matias Infante<br /> Whore Street Dancer - Claudia Castillo<br /> Whore Street Dancer - Patricia Godoy<br /> Lieutenant Cuevas - Rodrigo Orellana<br /> Liberators Group Member - Ian Bodenh&ouml;fer<br /> Liberators Group Member - Felipe Pizarro S&aacute;enz De Urtury<br /> Nun Quartet - &Aacute;ngela Acu&ntilde;a<br /> Sara's Father - Eyal Meyer</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
