<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>The Revenge of the Shiny Shrimps (2022)</h1>
    <!-- print original title -->
    <h3>La revanche des Crevettes Paillet&eacute;es</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/9nLB6wq6tow1M6tdadX2tqRuczy.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/The%20Revenge%20of%20the%20Shiny%20Shrimps%20%282022%29%20%5B720p%20h264%202.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Two years after the death of Jean, Matthias, the coach, decides to take Selime, a young man from the suburbs he believes is gay, to accompany the Shiny Shrimps to the Gay Games in Tokyo, on a trip to pay tribute to their friend who left too early. But after they miss their connection, they find themselves stranded in Russia, in one of the not the most gay-friendly regions in the world. The start of a crazy adventure as incredible as it is perilous.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Comedy</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Maxime Govare<br /> C&eacute;dric Le Gallo</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Maxime Govare<br /> C&eacute;dric Le Gallo</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Matthias Le Goff - Nicolas Gob<br /> Jean - Alban Lenoir<br /> Xavier - Geoffrey Cou&euml;t<br /> Alex - David Ba&iuml;ot<br /> Fred - Romain Brau<br /> Damien - Romain Lancry<br /> Jo&euml;l - Roland Menou<br /> C&eacute;dric - Micha&euml;l Abiteboul<br /> Vincent - F&eacute;lix Martinez<br /> S&eacute;lim - Bilal El Atreby<br /> Bertrand - Pierre Samuel<br /> Bram - Beno&icirc;t Mar&eacute;chal<br /> Rose - Yuliya Abiss<br /> Irina Vilonova - Iryna Mishyna<br /> Sasha - Oleksandr Ivanov<br /> Chef homophobe russe - Dmytro Soloviov<br /> Officier russe a&eacute;rodrome - Volodymyr Hladkyi<br /> Vassily, le prof de sport - Volodymyr Barabanov<br /> H&ocirc;tesse a&eacute;roport - Zo&eacute; Bruneau<br /> Pilote jet priv&eacute; - Maxime Govare<br /> Alain le copain du lyc&eacute;e - Nicolas Berno<br /> D&eacute;put&eacute; Vilonov - Aleksei Ageev<br /> Journaliste russe interview - Pavlo Kostitsyn<br /> Traductrice commissariat - Anna Konik<br /> Officiel ambassade russe - Anton Yakovlev<br /> Alice, la copine de Damien - Juliet Doucet<br /> St&eacute;phane - Vincent Rossi<br /> Patrick - Yohann Laveant<br /> Richard - Patrice Pujol<br /> V&eacute;ro - Isabelle Fruchart<br /> Russe homophobe - Petro Krylov<br /> Russe homophobe - Volodymyr Rashchuk<br /> Russe homophobe - Bohdan Yusypchuk<br /> Russe homophobe - Andrii Mordoviets<br /> H&ocirc;tesse - Kristina Yaroshenko<br /> M&egrave;re Bulgakov - Stalina Lahoshniak<br /> Garde - Serhii Smeian<br /> Commissaire de police - Viktor Semyrozumenko<br />  - Thomas Labiche</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
