<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Valerie and Her Week of Wonders (1970)</h1>
    <!-- print original title -->
    <h3>Valerie a t&yacute;den divů</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="https://image.tmdb.org/t/p/original/x9fZJORCZS0DshbxLSdnzyvU94V.jpg" width="180px"/></div></td> -->

		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="../images/Valerie%20and%20Her%20Week%20of%20Wonders%20-%20Criterion%20Collection%20%281970%29%20%5B1080p%20h265%201.0%5D-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Valerie, a Czechoslovakian teenager living with her grandmother, is blossoming into womanhood, but that transformation proves secondary to the effects she experiences when she puts on a pair of magic earrings. Now seeing the world around her in a different light, Valerie must endure her sexual awakening while attempting to discern reality from fantasy as she encounters lecherous priest Gracian, a vampire-like stranger and otherworldly carnival folk.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Fantasy, Adventure, Drama</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Jaromil Jire&scaron;</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Ester Krumbachov&aacute;<br /> Jaromil Jire&scaron;<br /> V&iacute;tězslav Nezval</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Valerie - Jaroslava Schallerov&aacute;<br /> Grandmother / Elsa / Mother / Redhead - Helena An&yacute;žov&aacute;<br /> Orl&iacute;k - Petr Kopřiva<br /> Tchoř-Constable - Jiř&iacute; Pr&yacute;mek<br /> Graci&aacute;n - Jan Klus&aacute;k<br /> Handmaid in Training - Libu&scaron;e Komancov&aacute;<br /> Coachman Ondřej - Karel Engel<br /> Hedvika - Alena Stoj&aacute;kov&aacute;<br /> Landlord - Otto Hradeck&yacute;<br /> Tchoř-Father - Martin Wielgus<br /> Flower Girl - Jiřina Machalick&aacute;<br /> Handmaid - Michaela Klocov&aacute;<br /> Handmaid - Zdenka Kov&aacute;řov&aacute;<br /> Handmaid - Bedři&scaron;ka Chalupsk&aacute;<br /> Drummer - Robert Nezval<br /> Valerie (voice) (uncredited) - Sl&aacute;vka &Scaron;pankov&aacute;<br /> Grandmother / Elsa / Mother / Redhead (voice) (uncredited) - Viola Zinkov&aacute;<br /> Grandmother / Elsa / Mother / Redhead (voice) (uncredited) - Nina Div&iacute;&scaron;kov&aacute;<br /> Hedvika (voice) (uncredited) - Hana Maciuchov&aacute;<br /> Handmaid-Madame (uncredited) - Eva Olmerov&aacute;<br /> Handmaid in Brother (uncredited) - Jana Andres&iacute;kov&aacute;<br /> Handmaid (uncredited) - Alice Auspergerov&aacute;<br /> Dancer (uncredited) - Eva Hn&aacute;tkov&aacute;<br /> Dancer (uncredited) - Z. Bl&aacute;hov&aacute;<br /> Dancer (uncredited) - Kristina Maarov&aacute;<br /> Fainting Virgin (uncredited) - Jarmila Lang&aacute;&scaron;kov&aacute;<br /> Whipper (uncredited) - Karel Bělohradsk&yacute;<br /> Whipper (uncredited) - Anton&iacute;n Cm&iacute;ral<br /> Whipper (uncredited) - Přemysl Krbec<br /> Whipper (uncredited) - Karel Medek<br /> Whipper (uncredited) - Petr Porada<br /> Whipper (uncredited) - Jiř&iacute; &Scaron;ťastn&yacute;<br /> Whipper (uncredited) - P. Du&scaron;ek<br /> Whipper (uncredited) - M. Folt&yacute;n<br /> Whipper (uncredited) - J. Kol&aacute;ř<br /> Whipper / Musician (uncredited) - V. Navr&aacute;til<br /> Musician (uncredited) - Jan Berka<br /> Musician (uncredited) - Jan Žižka<br /> Musician (uncredited) - M. Hotov&yacute;<br /> Musician (uncredited) - M. Rohan</div></td>
      </tr>
    </table>

    <a href=../movielist.html>back...</a>
  </body>

</html>
